Repository: Woofshahenzup/PuppyLinux-LangPacks-Spanish
Catalog: Woof2/usr/share/doc/nls/grub4dosconfig/*.po
Languages: de, fr, ja, ru

source: Configure bootup loader(Grub4Dos).
de: Boot-Lader (Grub4Dos) konfigurieren.
fr: Configurer le chargeur de boot (Grub4Dos)
ja: ブートアップローダ(Grub4Dos)の設定
ru: Настройка загрузчика (Grub4Dos).

source: Click 'OK' to search installed systems.
de: 'OK' klicken, um vorhandene System zu suchen
fr: Cliquez sur 'OK' pour rechercher le système installé
ja: 「OK」を押すとインストールされているオペレーティングシステムを検索します。
ru: 'OK' для поиска установленных систем.

source: Where to install bootup loader(Grub4Dos)?
de: Wohin soll der Boot-Lader (Grub4Dos) installiert werden?
fr: Où installer le chargeur de boot Grub4Dos
ja: どこにGrub4Dosをインストールしますか？
ru: Куда установить загрузчик (Grub4Dos)?

source: Usually on MBR(Master Boot Record)
de: Normalerweise in den MBR (Master Boot Record)
fr: Normalement sur le MBR (Master Boot Record)
ja: 普通はMBR(Master Boot Record)です。
ru: Обычно в MBR(Master Boot Record)

source: Search within only this drive
de: Nur auf diesem Laufwerk suchen
fr: Rechercher dans seulement ce disque
ja: このドライブ内だけを検索
ru: Искать только на этом диске

source: Search only this drive or partition
de: Nur auf diesem Laufwerk suchen
fr: Rechercher dans seulement ce disque
ja: このドライブまたはパーティション内だけを検索
ru: Искать только на этом диске

source: Do not rewrite the existing boot record
de: Beschreibe NICHT den vorhandenen Boot-Record
fr: Ne pas écraser un enregistrement de boot existant
ja: ブートレコードは書き換えない
ru: Не переписывать загрузочную запись

source: Do not rewrite 'menu.lst'
de: NICHT die Datei 'menu.lst' überschreiben
fr: Ne pas écraser 'menu.lst'
ja: 'menu.lst'は書き換えない
ru: Не переписывать 'menu.lst'

source: (Tick options ignored as for floppy)
de: (Diese Optionen werden bei Diskettenlaufwerken ignoriert.)
fr: (ignoré comme les disquettes)
ja: (FLOPPYの場合はすべてのチェック無効)
ru: (Опции, игнорируются для флоппи)

source: Help
de: Hilfe
fr: Aide
ja: ヘルプ
ru: Справка

source: Searching. Please wait...
de: Suche, bitte warten...
fr: Recherche en cours, patientez...
ja: 検索中。しばらくお待ちください...
ru: Поиск. Подождите...

source: Press 'OK' to quit this program.
de: 'OK' drücken, um das Programm zu beenden.
fr: Pressez 'OK' pour quitter ce programme.
ja: 「OK」ボタンを押してこのプログラムを終了してください。
ru: Нажмите 'OK' для выхода.

source: List of detected operating systems
de: Liste der gefundenen Betriebssysteme
fr: Liste des OS détectés
ja: 検出されたOSのリスト
ru: Список найденных операц. систем

source: You can rewrite each label. Or, erase. Caution: You cannot change their order.
de: Die Einträge können editiert oder gelöscht werden. Achtung: Die Reihenfolge ist nicht änderbar.
fr: Vous pouvez réécrire chaque étiquette. Ou, effacer. Attention: Vous ne pouvez pas changer leur ordre.
ja: それぞれ起動メニューに表示するタイトルを自由に変更できます。ただし順序を入れ替えることはできません。メニューから外したいものは空白にしてください。
ru: Вы можете переписать каждую. Или стереть. Внимание: нельзя менять их порядок.

source: Bootable partitions
de: Bootfähige Partitionen
ja: ブータブル・パーティション
ru: Загрузочные разделы

source: Comfirmation
de: Bestätigung
ja: 確認ください
ru: Подтверждение

source: The boot loader(Grub4Dos) will be installed on
de: Der Boot-Lader (Grub4Dos) wird installiert auf
fr: Le chargeur de boot (Grub4Dos) sera installé sur
ja: ブートローダ(Grub4Dos)のインストール先
ru: Загрузчик (Grub4Dos) будет установлен на

source: Press 'OK' to install. Press 'Cancel' if you do not like to.
de: 'OK' für Installation drücken. 'Cancel', wenn nicht gewünscht.
fr: Pressez 'OK' pour installer, 'Annuler' si ça ne vous convient pas
ja: インストールを続行するには「OK」を、中止するには「キャンセル」を押してください。
ru: Нажмите 'OK' для устатовки. Нажмите 'Отмена' если не хотите.

source: Insert floppy disk (all the data will be eraesed).
de: Diskette einlegen (alle Daten darauf werden gelöscht)
fr: Insérez une disquette. Tous les fichiers seront effacés.
ja: フロッピィディスクを挿入してください。内容はすべて消去されます。
ru: Вставьте флоппи (все данные будут стерты).

source: Formating floppy. Please wait ...
de: Formatiere Diskette. Bitte warten...
fr: Formatage de la disquette en cours, patientez...
ja: フォーマット中。お待ちください...
ru: Форматирование флоппи. Подождите...

source: Installing Grub4Dos. Please wait...
de: Installiere Grub4Dos. Bitte warten...
fr: Installation de Grub4Dos en cours, patientez...
ja: Grub4Dosをインストール中。お待ちください...
ru: Установка Grub4Dos. Подождите...

source: Somewhat error occured.
de: Irgendein Fehler trat auf.
fr: Une erreur est survenue
ja: 不明のエラーが生じました。
ru: Произошла ошибка.

source: Grub4Dos successfully installed.
de: Grub4Dos wurde erfolgreich installiert.
fr: Grub4Dos a été installé correctement.
ja: Grub4Dosは無事インストールされました。
ru: Grub4Dos успешно установлен.

source: The file(s),
de: Die Datei(en),
fr: Le(s) fichier(s),
ja: ファイル
ru: Файл(ы),

source: is on
de: ist auf
fr: est(sont) dans
ja: は
ru: на

source: You can edit 'menu.lst' before reboot.
de: Die Boot-Datei 'menu.lst' kann vor dem Booten editiert werden.
fr: Vous pouvez éditer menu.lst avant de redémarrer.
ja: に置かれました。再起動する前に menu.lst を編集することができます。
ru: Можете редакт. 'menu.lst' перед перезагрузкой.

source: If you installed on a removable device, ensure unmount the drive before remove it.
de: Wenn auf einem entfernbaren Medium (z.B. USB-Stick) installiert wird, sicherstellen, vor dem Entfernen 'unmount' durchzuführen.
fr: Si vous avez installé sur un périphérique amovible, assurez-vous de démonter le disque avant de le retirer.
ja: フロッピーディスクやUSBメモリ、外付けドライブなどにインストールした場合は、取り外しの前にアンマウントすることを忘れずに。
ru: Если устанавливали на съемное устройство, отмонтируйте его перед удалением.

source: Old 'menu.lst' found and renamed as follows:
de: Alte 'menu.lst' gefunden und umbenannt in:
fr: Les anciens 'menu.lst' ont été trouvés et renommés comme suit :
ja: 古い 'menu.lst' が見つかりました。それらの名前は次のように変更されました。
ru: Старый 'menu.lst' найден и переименован в:

source: Note: the boot record is not changed.
de: Hinweis: det Boot-Record (MBR) wurde nicht geändert.
fr: Le fichier enregistrement de boot n'a pas changé.
ja: 今回MBRは書き換えられていません。
ru: Заметьте: запись загрузки не изменена.

source: The MBR of the 1st drive has not changed this time. You may need to configure the BIOS or the MBR to make chain to
de: Der MBR des 1.Laufwerks wurde jetzt nicht geändert. Evt. müssen BIOS oder der MBR neu konfiguriert werden, um es dauerhaft zu machen.
fr: Le MBR du disque premier n'a pas changé cette fois. Vous devrez peut-être configurer le BIOS ou le MBR de faire la chaîne à
ja: 今回第１ドライブのMBRは書き換えられていません。起動順序をBIOSで設定するか、MBRから起動されたローダから橋渡しする設定が別途必要かもしれません
ru: MBR на 1-м диске не изменен в этот раз. Возможно вам нужно настроит BIOS или MBR чтобы сделать цепочку к

source: The boot-flag of the partition %s is not set. You may need to set the boot-flag using Gparted.
ja: パーティション %sの bootフラグはセットされていません。セットするにはGpartedなどを使ってください。

source: The MBR of the drive %s seems not bootable. You may need to install some bootloader there.
ja: ドライブ %s のMBRはブート可能ではないようです。なんらかのブートローダーをMBRにインストールする必要があるでしょう。

source: Edit 'menu.lst'
de: 'menu.lst' bearbeiten
fr: Editer menu.lst
ja: menu.lstを編集
ru: Редакт. 'menu.lst'

source: Grub not found. Grub(other than Grub4Dos) which supports ext4 is required if the 1st partition of the target drive is ext4 file system.
de: Grub nicht gefunden. Ein Grub (anderer als Grub4Dos), der Ext4 unterstützt, wird benötigt, wenn die 1.Partition des Ziellaufwerks ein Ext4-Dateisystem aufweist.
fr: Grub non trouvé. Grub (différent de Grub4Dos) qui prend en charge ext4 est requis si le système de fichiers de la première partition du disque cible est en ext4.
ja: Grubがみつかりません。インストール先の第1パーティションのファイルシステムがext4の場合、Grub4Dosのほかにext4をサポートしたGrubが必要です。
ru: Grub не найден. Grub(не Grub4Dos), который поддерживает ext4 необходим если 1-й раздел диска - раздел ext4.

source: Grub4dos Guide online
de: Grub4Dos Anleitung online
fr: Document en ligne
ja: オンラインドキュメント
ru: Grub4dos Онлайн справка

source: Options
de: Optionen
ja: 追加オプション
ru: Опции

source: You can edit the boot options add to all frugal installed Puppy.
de: Boot-Optionen können editiert und allen Frugal Puppy-Installationen zugefügt werden.
fr: Vous pouvez modifier les options de démarrage ajouter à tous les frugal Puppy installé.
ja: すべてのFrugalインストールに共通する起動時パラメータを追記することができます。
ru: Вы можете редакт. опции загрузки ко всем frugal установкам Puppy.

source: You can edit the boot options add to all full installed Linux.
de: Boot-Optionen können editiert und allen Linux-Installationen zugefügt werden.
fr: Vous pouvez modifier les options de démarrage ajouter à tout plein Linux installé.
ja: すべてのFullインストールに共通する起動パラメータを追記することができます。
ru: Вы можете редакт. опции загрузки ко всем полным установкам Linux.

source: Old MBR is saved
de: Alter MBR wurde gesichert.
fr: Ancien MBR est sauvegardé
ja: 以前のMBRが退避されました
ru: Старый MBR сохранен.

source: To restore the MBR, type next command on console
de: Um den MBR wieder herzustellen, nachfolgendes Kommando in einer Konsole eingeben
fr: Pour restaurer le MBR, tapez la commande suivante sur la console
ja: 以前のMBRを復旧させるには、コンソールから次のコマンドを実行してください。
ru: Для восстановления MBR, наберите следующую команду в консоли

source: Next puppy directories have same name on multiple partitions. It may confuse the bootup procces. Recommended to press 'Cancel' to quit this program, change the names of the directories, and then restart this program.\nBut you can continue this program pressing 'OK'.
de: Nachfolgende Puppy-Verzeichnisse haben den denselben Namen auf unterschiedlichen Partitionen. Das kann zu Fehlern beim Booten führen. Es wird empfohlen, das Programm abzubrechen ('Cancel'), die Namen der Verzeichnisse zu ändern und das System neu zu starten.\nAber es kann auch weiter gemacht werden durch drücken von 'OK'.
fr: Suivant répertoires chiot ont le même nom sur plusieurs partitions. Il peut confondre les procces démarrage. Recommandé d'appuyer sur 'Annuler(Cancel)' pour quitter ce programme, changer les noms des répertoires et puis redémarrez ce programme.\nMais vous pouvez continuer ce programme en appuyant sur 'OK'.
ja: 次のディレクトリ名は重複しています。これは起動プロセスを混乱させるかもしれません。「キャンセル」を押してこのプログラムを中断し、ディレクトリの名前を変更することをお勧めします。\nでも「OK」を押してこのまま続けることもできます。
ru: Следующие каталоги puppy имеют одинаковые имена на разных разделах. Это может запутать процесс загрузки. Рекомендуется нажать 'Отмена' для выхода из программы, изменить имена каталогов и потом запустить эту программу. Но можете продолжить программу нажатием 'OK'.

source: The first entry is always shown regardless Windows are installed or not. Recommended to keep the entry.
de: Der erste Eintrag wird immer angezeigt, ungeachtet dessen, ob Windows überhaupt installiert ist. Empfohlen wird, diesen Eintrag zu belassen.
fr: La première entrée est toujours montré peu de Windows sont installés ou non. Recommandé pour garder l'entrée.
ja: 最初の項目はWindowsがインストールされているかどうかにかかわらず現れます。この項目を残しておくことをお勧めします。
ru: Первая запись всегда показана, не важно, установлена Windows или нет. Рекомендуется сохранить запись.

source: The Grub4DosConfig seems improperly installed. Missing files
de: Grub4DosConfig scheint unvollständig installiert zu sein. Fehlende Dateien
fr: Le Grub4DosConfig semble mal installé. Fichiers manquants
ja: Grub4DosConfigが正しくインストールされていません。不足のファイル
ru: Grub4DosConfig, кажется, неправильно установлен. Нет файлов

source: Some componets are lacking to perform this function
ja: この機能を実行するにはいくつかの要素が欠けています。

source: No supported filesystems found in
ja: サポートされるファイルシステムがありません。

source: Sectors/Track is expected 63.
de: Erwartete Sektoren/Tracks: 63.
fr: Sectors/Track est prévu 63.
ja: Sectors/Trackは 63でなくてはなりません。
ru: Sectors/Track ожидается 63.

source: But the drive
de: Aber das Laufwerk
fr: Mais le disque
ja: しかしこのドライブの
ru: Но диск

source: seems Sectors/Track
de: hat anscheinend Sektoren/Tracks:
fr: semble Sectors/Track
ja: Sectors/Track は
ru: кажется Sectors/Track

source: The Grub4DosConfig does not support this drive.
de: Grub4DosConfig unterstützt dieses Laufwerk nicht.
fr: Le Grub4DosConfig ne prend pas en charge ce disque.
ja: Grub4DosConfig はこのドライブをサポートしません。
ru: Grub4DosConfig не поддерживает этот диск.

source: Remove all the partitions on the drive (after backing up all the data) and rewrite the partition tabe with Gparted.
de: Entferne alle Partitionen auf dem laufwerk (nach einer Datensicherung) und schreibe eine Partitionstabelle mit GParted.
fr: Supprimer toutes les partitions sur le disque (après avoir échappé à toutes les données) et de réécrire la partition table en utilisant Gparted.
ja: Gpartedを用いてすべてのパーティションを削除（データはあらかじめバックアップしておいてください）したのち、新たにパーティションを作成してください。
ru: Удалите все разделы на диске (после сохранения данных) и перепишите таблицу разделов с Gparted.

source: Select the device you would like to boot from. Usually the first drive(MBR), but you can select floppy(fd0) if available, or USB removable devices. You may need to change the BIOS setting.
de: Das Laufwerk, von dem gebootet werden auswählen. Normalerweise das 1.Laufwerk (MBR), aber ein Diskettenlaufwerk ist (Floppy/fd0) ebenso möglich oder ein entfernbarer USB-Speicher. Evt. muss die BIOS-Einstellung angepasst werden.
fr: Sélectionnez le périphérique que vous souhaitez démarrer à partir. Habituellement, le premier disque (MBR), mais vous pouvez choisir de disquette (fd0) si disponible, ou de périphériques USB amovibles. Vous devrez peut-être modifier les paramètres BIOS.
ja: 起動するデバイスを選択してください。通常は最初のドライブのMBRです。あるいはフロッピーやUSBデバイスが（もしあれば）選択できます。選択によってはBIOSの設定も変更する必要があるかもしれません。
ru: Выберите устройство с которого хотите загружаться. Обычно первый диск(MBR), но вы можете выбрать флоппи(fd0) если есть или сменный носитель USB. Возможно, вам нужно изменить настройки БИОС.

source: Ignored for floppies
de: Bei Diskettenlaufwerken ignoriert.
fr: Il est ignoré que pour la disquette.
ja: フロッピーでは無効
ru: Игнорируется для флоппи

source: Or, for PBS install, it searches only the partiton and is recommended.
ja: パーティション(PBS)にインストールする場合はそのパーティション内だけを検索します。PBSの場合お奨め。

source: Limit the search scope so that the installations on other drives are not listed up. Recommended only for removal devices.
de: Begrenzt den Suchbereich, um die Installationen auf anderen Laufwerken nicht aufzulisten. Empfohlen für entfernbare USB-Speicher.
fr: Limiter la portée de la recherche afin que les installations sur d'autres lecteurs ne sont pas répertoriés en place. Recommandé uniquement pour les dispositifs de retrait.
ja: 検索範囲をこのドライブ内に限定し、他をリストアップしない。USBなどリブーバブルメディアでは推奨されます。
ru: Ограничение поиска, так, что систем на других дисках нет в списке. Рекомендуется только для сменных носителей.

source: Only if you do not want to change your existing MBR. Your boot sequence should be ready to start up grubldr.
de: Nur, wenn der vorhandene MBR nicht geändert werden soll. Die vorhandene Boot-Sequenz sollte funktionieren.
fr: Seulement si vous ne souhaitez pas modifier le MBR existant. Votre séquence de démarrage doit être prêt à démarrer grubldr.
ja: すでにあるMBRを変更したくないときにのみチェックしてください。現在 grldrが起動できるようになっていることが前提です。
ru: Только если вы не хотите менять существующий MBR. Ваш БИОС должен быть готов загрузить grubldr.

source: Only if you want to keep the existing menu.lst and you can handle it manually.
de: Nur, wenn die vorhandene 'menu.lst' erhalten und manuell bearbeitet werden soll.
fr: Seulement si vous voulez garder le menu.lst existant et vous pouvez le manipuler manuellement.
ja: 現在ある menu.lstを自動で書き換えず、手動で編集したいときにのみチェックしてください。
ru: Только если вы хотите сохранить существующий menu.lst и можете управлять им вручную.

source: A 'menu.lst' found at irregular place
de: Eine 'menu.lst' an unzulässigem Ort gefunden.
fr: 'menu.lst' trouvé sur le lieu irrégulière
ja: menu.lstが不適切な場所にあります
ru: 'menu.lst' найден в необычном месте

source: Recommended is to make new one
de: Es wird empfohlen, eine neue anzulegen
fr: Il est recommandé de faire une nouvelle
ja: 新しく作成することをお勧めします。
ru: Рекомендуется создать новый

source: but you can skip to make new one by checking the box on.
de: aber das kann übersprungen werden (durch Haken in der Box)
fr: mais vous pouvez sauter pour faire un nouveau en cochant la case sur.
ja: それでも新しく作成したくなければ、もういちどチェックを入れてください。
ru: Но вы можете пропустить создание нового, установив флажок.

source: No 'menu.lst' found.
de: Keine 'menu.lst' gefunden.
fr: Il n'ya pas de fichiers 'menu.lst'.
ja: menu.lstが見つかりません。
ru: 'menu.lst не найден.

source: Not found
de: Nichts gefunden
fr: Il n'ya pas
ja: 見つかりません。
ru: Не найдено

source: Show PBS
ja: PBSも表示

source: Hide PBS
ja: PBSを隠す

source: Show all partitions if you want to install the bootloader on the partition boot sector(PBS).
ja: パーティション(PBS)にインストールしたいのなら、ここをクリックしてパーティションも表示させてください。

source: Proceed anyway
ja: とにかく続ける

source: Refresh
ja: 再検索

source: Probe devices again.
ja: デバイスを再検索

source: Boot flag not found on %s.
ja: ディスク %s に boot フラグがありません

source: Some BIOS does not boot from the drive which has no boot flag. Click 'Cancel' here and set the boot flag by using GParted or something. But you can proceed installing grub4dos first.
ja: BIOSによっては boot フラグの無いドライブからブートすることができません。「キャンセル」をクリックし、GPartedなどで bootフラグをセットしてください。でも、このまま grub4dosのインストールを続けることもできます。

source: Confirmation
de: Bestätigung
ja: 確認ください
ru: Подтверждение

source: See log
ja: ログを見る

source: Grub4Dos Guide
de: Grub4Dos-Anleitung
ru: Grub4Dos Гид

source: Frugal installed Puppy
de: Frugal Puppy-Installation
fr: Installation Frugale de Toutou
ru: Frugal установка Puppy

source: Full installed Puppy or other Linux
de: Volle Puppy-Installation oder anderes Linux
fr: Installation complète de Toutou
ru: Полная установка Puppy или др. Linux

source: Windows
de: Microsoft Windows
