Repository: Woofshahenzup/PuppyLinux-LangPacks-Spanish
Catalog: Woof2/usr/share/doc/nls/i18n_tray/*.po
Languages: ru

source: Click this icon for network setup
ru: Нажмите на этот значок для настройки сети

source: personal storage, free space
ru: персональный файл, свободно

source: (Month:%dMB)
ru: (Месяц:%dМБ)

source: Active interfaces:
ru: Активные интерфейсы:

source: Battery charge
ru: Зарядка батареи

source: Battery charging, capacity
ru: Батарея заряжается, ёмкость

source: Battery discharging, capacity
ru: Батарея разряжается, ёмкость

source: Change Network Tray Icon Theme
ru: Выбрать значок

source: Disconnect from network
ru: Отключить от сети

source: KB
ru: КБ

source: MB
ru: MБ

source: Network status information
ru: Информация о статусе сети

source: No active network interfaces
ru: Нет активных сетевых интерфейсов

source: Reconnect to network
ru: Переподключение к сети

source: Setup networking
ru: Настройка сети

source: none
ru: нет

source: yaf-splash -placement bottom -bg purple -timeout 10 -text 'Note: right-click icon for network menu' &
ru: yaf-splash -placement bottom -bg purple -timeout 10 -text 'Примечание: правый клик откроет сетевое меню' &
