<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html><head>
<meta http-equiv="content-type" content="text/html; charset=ISO-8859-1"><title></title></head><body style="color: rgb(0, 0, 0); background-color: rgb(255, 204, 255);" alink="#ee0000" link="#0000ee" vlink="#551a8b">
<h1>Ayuda para la Interfaz Web de CUPS<br>
</h1>
<br>
Se deber&iacute;a haber abierto su navegador predeterminado (o se 
abrir&aacute; despu&eacute;s de 3-30 segundos) con la interfaz web de 
CUPS. Aqu&iacute; usted puede agregar y configurar su impresora. <br>
<br>
IMPORTANTE: Si se le pide usuario y contrase&ntilde;a, ingrese 'root' y 'woofwoof'.<br>
<br>
Haga clic en <b>Administrar Impresoras</b>, luego en <b>A&ntilde;adir Impresora</b>. Ingrese un nombre para su impresora, ej. <b>HL1030</b>. Los campos de <b>Ubicaci&oacute;n</b> y <b>Descripci&oacute;n</b> se pueden dejar en blanco. Haga clic en <b>Continuar</b>.<br>
<br>
Los pasos que siguen despu&eacute;s deber&iacute;an ser directos, y 
esperamos que usted encuentre un controlador de impresora que le 
funcione. Finalmente deber&iacute;a ver un mensaje: <b>Impresora HL1030 a&ntilde;adida exitosamente</b>.<br>
<br>
Haga clic en <b>Impresoras</b>, <b>Configurar Impresora</b> para cambiar el <b>Tama&ntilde;o de la P&aacute;gina</b> (si es necesario) y la <b>Resoluci&oacute;n</b> (600 DPI es buena para la mayor&iacute;a de los trabajos). Haga clic en <b>Continuar</b>, luego en <b>Impresoras</b> de nuevo. El <b>Estado de la Impresora</b><b></b> deber&iacute;a ser <b>en espera, aceptando trabajos</b>.<br>
<br>

Finalmente, haga clic en <b>Imprimir P&aacute;gina de Prueba</b> para ver si su impresora funciona.<span style="font-weight: bold;"></span><br>
<h2>Controladores para impresoras<br>
</h2>
Puppy tiene el paquete Gutenprint, que tiene un mont&oacute;n de 
controladores de impresora. Sin embargo, si su impresora no est&aacute; 
entre ellos, usted puede buscar un controlador en l&iacute;nea. Por 
ejemplo, necesito un controlador para mi impresora l&aacute;ser Brother 
HL2040 (se localiz&oacute;, y lo puse permanentemente en Puppy, vea en 
/usr/share/cups/model/<a style="font-weight: bold;" href="file:///usr/share/cups/model/Brother-HL-2040-hl1250.ppd">Brother-HL-2040-hl1250.ppd</a>
 si tiene curiosidad sobre c&oacute;mo se ve un archivo de controlador 
de impresora. N&oacute;tese que el archivo tiene extensi&oacute;n <span style="color: rgb(204, 0, 0); font-weight: bold;">.ppd</span>).<br>
<br>
Dos fabricantes con excelente soporte para Linux son <b>Brother</b> y <b>Hewlett Packard</b>, y los entusiastas de Puppy han creado paquetes PET de ellos.<br>
<br>
Al momento de escribir esto, el paquete de Hewlett Packard <b>Hpliplite</b> est&aacute; disponible en el repositorio oficial de Puppy4 (paquete creado por MU). Simplemente inicie el <b>Gestor de Paquetes de Puppy </b>o <b>PPM </b>(vea
 la categor&iacute;a Configuraci&oacute;n en el men&uacute;) y busque 
"hpliplite". Este paquete tiene soporte para una amplia gama de 
impresoras y esc&aacute;neres Hewlett Packard.<br>
<br>
Para buscar soluciones para otras impresoras o paquetes m&aacute;s 
actualizados, por favor vaya a estas secciones de nuestro foro principal
 de Puppy (en ingl&eacute;s):<br>
<br>
<span style="font-weight: bold;">Categor&iacute;a Impresi&oacute;n</span>: <a style="font-weight: bold;" href="http://murga-linux.com/puppy/index.php?f=27">http://murga-linux.com/puppy/index.php?f=27</a> <br>
<span style="font-weight: bold;">Software Adicional</span>: <a style="font-weight: bold;" href="http://murga-linux.com/puppy/index.php?f=11">http://murga-linux.com/puppy/index.php?f=11</a> <br>
<br>

&iexcl;Divi&eacute;rtase!<br>
Barry Kauler<br>
<br>
</body></html>